In [9]:
#from flask import Flask, render_template, request, jsonify
def math_operation():
        operation='add'
        num1=23
        num2=34
    
        if(operation=='add'):
            r=num1+num2
            result= 'the sum of '+str(num1)+' and '+str(num2) +' is '+str(r)
        if (operation == 'subtract'):
            r = num1 - num2
            result = 'the difference of ' + str(num1) + ' and ' + str(num2) + ' is ' + str(r)
        if (operation == 'multiply'):
            r = num1 * num2
            result = 'the product of ' + str(num1) + ' and ' + str(num2) + ' is ' + str(r)
        if (operation == 'divide'):
            r = num1 / num2
            result = 'the quotient when ' + str(num1) + ' is divided by ' + str(num2) + ' is ' + str(r)
        return (result)

In [10]:
math_operation()

'the sum of 23 and 34 is 57'

In [1]:
! pip install pymongo

Collecting pymongo
  Downloading pymongo-3.11.4-cp38-cp38-win_amd64.whl (383 kB)
Installing collected packages: pymongo
Successfully installed pymongo-3.11.4

In [2]:
23&23

23

In [15]:
def Add():
    try:
        n1=int(input('Enter an integer number : '))
        if n1==4:
            raise Exception("you can not pass 4")
    except Exception as e:
        print(e)

In [16]:
Add()

Enter an integer number : 4
you can not pass 4

In [2]:
t=[i*j for i in range(3) for j in range(4)]

In [3]:
print(t) # this is the reaction of our files

[0, 0, 0, 0, 0, 1, 2, 3, 0, 2, 4, 6]

In [1]:
import sqlite3

In [4]:
t=sqlite3.connect("mydb") # t is a database object actually

In [6]:
t.execute("create table mytable (roll_number int , name varchar );")

In [16]:
t.execute("insert into mytable (roll_number,name) values (1,'Mujtaba Ali');")

In [17]:
 for i in t.execute("select * from mytable"):
        print(i)

(1, 'Mujtaba Ali')
(2, 'Arshad Malik')
(3, 'Rakesh Kumar')
(4, 'Mohd Arif')
(2, 'Arshad Malik')
(3, 'Rakesh Kumar')
(4, 'Mohd Arif')
(1, 'Mujtaba Ali')

In [18]:
t.execute("insert into mytable (roll_number,name) values (2,'Arshad Malik'),(3,'Rakesh Kumar'),(4,'Mohd Arif');")

In [19]:
 for i in t.execute("select * from mytable"):
        print(i)

(1, 'Mujtaba Ali')
(2, 'Arshad Malik')
(3, 'Rakesh Kumar')
(4, 'Mohd Arif')
(2, 'Arshad Malik')
(3, 'Rakesh Kumar')
(4, 'Mohd Arif')
(1, 'Mujtaba Ali')
(2, 'Arshad Malik')
(3, 'Rakesh Kumar')
(4, 'Mohd Arif')

In [15]:
 for i in t.execute("select * from mytable"):
        print(i)

(1, 'Mujtaba Ali')
(2, 'Arshad Malik')
(3, 'Rakesh Kumar')
(4, 'Mohd Arif')
(2, 'Arshad Malik')
(3, 'Rakesh Kumar')
(4, 'Mohd Arif')

In [20]:
import sqlite3

In [33]:
r=sqlite3.connect("alidatabas1.db");

In [34]:
r.execute("create table tr(id int ,name varchar(20),course varchar(30),semester varchar(30))");

In [35]:
r.execute("insert into tr(id,name,course,semester) values(1,'Mujtaba Ali','BTech','2nd')");

In [36]:
r.commit()

In [37]:
import sqlite3

In [38]:
R=sqlite3.connect("iftm")

In [48]:
R.execute("create table students_info (roll_number int  primary key AUTOINCREMENT ,name varchar(10) not null , fathers name varchar(30) not null)");

OperationalError: table students_info already exists

In [55]:
R.execute("insert into students_info values(1,'Mujtaba Ali','mr.hafiz muqeem')");

In [57]:
R.commit() # commit is necessary for adding data into database

In [60]:
 R.execute('''insert into students_info values(2,'Mujtaba Ali','mr.hafiz muqeem'),
           (3,'Mujtaba Ali','mr.hafiz muqeem'),
           (4,'Mujtaba Ali','mr.hafiz muqeem'),
           (5,'Mujtaba Ali','mr.hafiz muqeem'),
           (6,'Mujtaba Ali','mr.hafiz muqeem'),
           (7,'Mujtaba Ali','mr.hafiz muqeem'),
           (8,'Mujtaba Ali','mr.hafiz muqeem'),
           (9,'Mujtaba Ali','mr.hafiz muqeem'),
           (10,'Mujtaba Ali','mr.hafiz muqeem'),
           (11,'Mujtaba Ali','mr.hafiz muqeem'),
           (12,'Mujtaba Ali','mr.hafiz muqeem'),
           (13,'Mujtaba Ali','mr.hafiz muqeem') ''');

In [66]:
t=R.commit()

In [68]:
for i in list(R.execute("select * from students_info")):
    print(i)

(1, 'Mujtaba Ali', 'mr.hafiz muqeem')
(2, 'Mujtaba Ali', 'mr.hafiz muqeem')
(3, 'Mujtaba Ali', 'mr.hafiz muqeem')
(4, 'Mujtaba Ali', 'mr.hafiz muqeem')
(5, 'Mujtaba Ali', 'mr.hafiz muqeem')
(6, 'Mujtaba Ali', 'mr.hafiz muqeem')
(7, 'Mujtaba Ali', 'mr.hafiz muqeem')
(8, 'Mujtaba Ali', 'mr.hafiz muqeem')
(9, 'Mujtaba Ali', 'mr.hafiz muqeem')
(10, 'Mujtaba Ali', 'mr.hafiz muqeem')
(11, 'Mujtaba Ali', 'mr.hafiz muqeem')
(12, 'Mujtaba Ali', 'mr.hafiz muqeem')
(13, 'Mujtaba Ali', 'mr.hafiz muqeem')

In [70]:
R.execute("update students_info set name='Arshad Malik' Where roll_number=1");

In [71]:
for i in list(R.execute("select * from students_info")):
    print(i)

(1, 'Arshad Malik', 'mr.hafiz muqeem')
(2, 'Mujtaba Ali', 'mr.hafiz muqeem')
(3, 'Mujtaba Ali', 'mr.hafiz muqeem')
(4, 'Mujtaba Ali', 'mr.hafiz muqeem')
(5, 'Mujtaba Ali', 'mr.hafiz muqeem')
(6, 'Mujtaba Ali', 'mr.hafiz muqeem')
(7, 'Mujtaba Ali', 'mr.hafiz muqeem')
(8, 'Mujtaba Ali', 'mr.hafiz muqeem')
(9, 'Mujtaba Ali', 'mr.hafiz muqeem')
(10, 'Mujtaba Ali', 'mr.hafiz muqeem')
(11, 'Mujtaba Ali', 'mr.hafiz muqeem')
(12, 'Mujtaba Ali', 'mr.hafiz muqeem')
(13, 'Mujtaba Ali', 'mr.hafiz muqeem')

In [74]:
R.execute("delete  from students_info where roll_number=1 ");

In [75]:
for i in list(R.execute("select * from students_info")):
    print(i)

(2, 'Mujtaba Ali', 'mr.hafiz muqeem')
(3, 'Mujtaba Ali', 'mr.hafiz muqeem')
(4, 'Mujtaba Ali', 'mr.hafiz muqeem')
(5, 'Mujtaba Ali', 'mr.hafiz muqeem')
(6, 'Mujtaba Ali', 'mr.hafiz muqeem')
(7, 'Mujtaba Ali', 'mr.hafiz muqeem')
(8, 'Mujtaba Ali', 'mr.hafiz muqeem')
(9, 'Mujtaba Ali', 'mr.hafiz muqeem')
(10, 'Mujtaba Ali', 'mr.hafiz muqeem')
(11, 'Mujtaba Ali', 'mr.hafiz muqeem')
(12, 'Mujtaba Ali', 'mr.hafiz muqeem')
(13, 'Mujtaba Ali', 'mr.hafiz muqeem')

In [85]:
R.execute("alter table students_info add Email varchar(40) ");

OperationalError: duplicate column name: Email

In [86]:
for i in list(R.execute("select * from students_info")):
    print(i)

(2, 'Mujtaba Ali', 'mr.hafiz muqeem', 'alimujtaba9012@gmail.com')
(3, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(4, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(5, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(6, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(7, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(8, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(9, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(10, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(11, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(12, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(13, 'Mujtaba Ali', 'mr.hafiz muqeem', None)

In [87]:
R.execute("update students_info set Email='alimujtaba9012@gmail.com' where roll_number=2");

In [88]:
for i in list(R.execute("select * from students_info")):
    print(i)

(2, 'Mujtaba Ali', 'mr.hafiz muqeem', 'alimujtaba9012@gmail.com')
(3, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(4, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(5, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(6, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(7, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(8, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(9, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(10, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(11, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(12, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(13, 'Mujtaba Ali', 'mr.hafiz muqeem', None)

In [81]:
R.commit()

In [95]:
R.execute("alter table students_info rename to mujtaba");
R.commit()

OperationalError: no such table: students_info

In [96]:
for i in list(R.execute("select * from mujtaba")):
    print(i)

(2, 'Mujtaba Ali', 'mr.hafiz muqeem', 'alimujtaba9012@gmail.com')
(3, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(4, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(5, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(6, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(7, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(8, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(9, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(10, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(11, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(12, 'Mujtaba Ali', 'mr.hafiz muqeem', None)
(13, 'Mujtaba Ali', 'mr.hafiz muqeem', None)

In [94]:
R.commit()

# mysql structured query language

In [97]:

import mysql.connector as connection

In [109]:
try: # exception handling
    mydb=connection.connect(host="localhost",user="root",password="root")
    #print(mydb.is_connected())
    query="show databases"
    mycursor=mydb.cursor()
    mycursor.execute(query)
    print(mycursor.fetchall())
except Exception as e:
    print(e)
 # connection is established

[('btech',), ('demopython',), ('information_schema',), ('mydb',), ('mysql',), ('performance_schema',), ('student',), ('sys',), ('university_database',)]

In [113]:
try:
    mydb=connection.connect(host="localhost",user="root",password="root") # mydb is an object actually 
    print(mydb.is_connected())
    query="create database uttarP"
    mycursor=mydb.cursor()
    mycursor.execute(query)
    mydb.close()
    
except Exception as e:
    mydb.close()
    print(e)

True

In [128]:
try:
    mydb=connection.connect(host="localhost",user="root",password="root",database="uttarP")
    print(mydb.is_connected())
    query="create table rampur (id int not null , SdmName varchar(30) not null,VdoName varchar(30) , NofVillages int)"
    mycursor=mydb.cursor()
    mycursor.execute(query)
    
   
    
except Exception as e:
    print(e)

True
1050 (42S01): Table 'rampur' already exists

In [129]:
 mydb=connection.connect(host="localhost",user="root",password="root",database="uttarP")
print(mydb.is_connected())
query="insert into rampur (id,SdmName,VdoName,NofVillages) values(1,'Mujtaba Ali','Ramzam khan',100)"
mycursor=mydb.cursor()
mycursor.execute(query)
mydb.close()

True

ProgrammingError: 1054 (42S22): Unknown column 'NofVillages' in 'field list'

In [133]:
try:
    mydb=connection.connect(host="localhost",user="root",password="root",database="uttarP")
    print(mydb.is_connected())
    query="insert into rampur(id,SdmName,VdoName,NofVaillages) values(2,'Mujtaba Ali','Tarwez Ansari',40)"
    mycursor=mydb.cursor()
    mycursor.execute(query)
    mydb.close()
except Exception as e:
    mydb.close()
    
    print(e)

True

In [135]:
try:
    mydb=connection.connect(host="localhost",user="root",password="root",database="uttarp")
    print(mydb.is_connected())
    query="insert into rampur(id,SdmName,VdoName,NofVaillages) values(2,'Mujtaba Ali','Tarwez Ansari',40)"
    mycursor=mydb.cursor()
    mycursor.execute(query)
    mydb.close()
except Exception as e:
    mydb.close()
    
    print(e)

True

In [136]:
try:
    mydb=connection.connect(host="localhost",user="root",password="root",database="uttarp")
    print(mydb.is_connected())
    query="insert into rampur(id,SdmName,VdoName,NofVaillages) values(2,'Mujtaba Ali','Tarwez Ansari',40)"
    mycursor=mydb.cursor()
    mycursor.execute(query)
    mydb.close()
except Exception as e:
    mydb.close()
    
    print(e)

True

In [137]:

import mysql.connector as connection

In [140]:
try:
    myd=connection.connect(host="localhost",database="uttarp",user="root",password="root",use_pure=True)
    print(myd.is_connected())
    q="insert into rampur (id,SdmName,VdoName,NofVaillages) values(4,'tariq','jafar',100)"
    mycur=myd.cursor()
    mycur.execute(q)
    myd.close()
except Exception as e:
    print(e)

True

In [143]:
import mysql.connector as connection
try:
    mydb=connection.connect(host="localhost",user="root", password="root")
    print(mydb.is_connected())
    query="create database laptop"
    my_cursor=mydb.cursor()
    my_cursor.execute(query)
    my_cursor.close()
except Exception as e:
    print(e)

True

In [146]:
import mysql.connector as connection
try:
    mydb=connection.connect(host="localhost",user="root", password="root",database="laptop")
    print(mydb.is_connected())
    query="create table asus(serial_number int , Name varchar(30), price int)"
    my_cursor=mydb.cursor()
    my_cursor.execute(query)
    my_cursor.close()
except Exception as e:
    print(e)

True

In [149]:
import mysql.connector as connection
try:
    mydb=connection.connect(host="localhost",user="root", password="root",database="laptop")
    print(mydb.is_connected())
    query="insert into asus(serial_number,Name,Price) values(123,'Vivobook',245000)"
    my_cursor=mydb.cursor()
    my_cursor.execute(query)
    mydb.commit() # we have to use commit to add data into database
    my_cursor.close()
except Exception as e:
    print(e)

True

In [152]:
query="insert into asus(serial_number,Name,Price) values(342,'ultra notebook',50000)"
my_cursor=mydb.cursor()
my_cursor.execute(query)
mydb.commit()

In [153]:
query="insert into asus(serial_number,Name,Price) values(765,'Notebook pro',675555)"
my_cursor.execute(query)
mydb.commit()

In [1]:
import mysql.connector as conncetion

In [5]:
try:
    mydb=conncetion.connect(host="localhost",user="root",password="root",database="btech")
    print(mydb.is_connected())
    query="select * from data"
    mycursor=mydb.cursor()
    mycursor.execute(query)
    for r in mycursor.fetchall():
        print(r)
    mydb.close()    
except Exception as e:
    print(e)

True
('100', 'Arif Ali', '5.54', '7.56', '8.56')
('19118001', 'AAKASH KUMAR', '7.07', '7.72', '7.4')
('19118002', 'ABDHESH', '6.83', '7.41', '7.12')
('19118003', 'ABHISHEK BHARTI', '8.07', '9.14', '8.6')
('19118004', 'AJAY VANSH', '7.31', '8.41', '7.86')
('19118005', 'AKASH KUMAR', '7.55', '8.55', '8.05')
('19118006', 'AMBIKA SONI', '7.52', '8.86', '8.19')
('19118007', 'AMISH MITTAL', '6.03', '7.45', '6.74')
('19118008', 'AMIT KUMAR', '7.1', '7.72', '7.41')
('19118009', 'ANKUR KUMAR', '8.79', '9.14', '8.97')
('19118010', 'ANSHIKA GOSWAMI', '8.66', '9.31', '8.98')
('19118011', 'ANUJ KUMAR', '7.41', '8.62', '8.02')
('19118012', 'ARJUN KUMAR', '7.9', '8.59', '8.24')
('19118013', 'ARSHAD MALIK', '8.38', '8.83', '8.6')
('19118014', 'ARVIND KUMAR', '7.1', '8.28', '7.69')
('19118015', 'ASHUTOSH KUMAR TIWARI', '7.79', '9.07', '8.43')
('19118016', 'AYUSHI', '6.55', '6.34', '6.45')
('19118017', 'BARJ PAL SINGH', '6.9', '0.31', '3.6')
('19118018', 'CHIRAG SINGH', '7.69', '9', '8.34')
('19118019', 'DEVENDRA SINGH', '9.21', '8.86', '9.03')
('19118021', 'DIVYANSH GUPTA', '6.97', '9.14', '8.05')
('19118022', 'DURVESH KUMAR', '7.9', '8.03', '7.97')
('19118023', 'HARSH KUMAR GAUTAM', '6.69', '8.72', '7.71')
('19118024', 'JAGMOHAN SINGH', '6.38', '0.31', '3.34')
('19118025', 'JAYDEEP BABU', '7.41', '8.55', '7.98')
('19118026', 'KAMINI SINGH', '6.93', '8.55', '7.74')
('19118027', 'KM. KHUSHBOO', '7.69', '8.72', '8.21')
('19118028', 'KM. ANCHAL PAWAN', '7.24', '8.97', '8.0')
('19118029', 'LOKANDER', '7.48', '8.69', '8.09')
('19118030', 'MAYANK KUMAR', '7.07', '8.31', '7.69')
('19118031', 'MOHD DANISH', '8.93', '8.69', '8.81')
('19118032', 'MOHD NADEEM ALI', '8.1', '9', '8.55')
('19118033', 'MOHIT SAGAR', '7.38', '8.55', '7.97')
('19118034', 'MUJTABA ALI', '9.38', '8.28', '8.83')
('19118035', 'NILESH KUMAR', '7.76', '8.45', '8.1')
('19118036', 'PIYUSH SHARMA', '6.9', '8.31', '7.6')
('19118037', 'PRASHASTI', '8.48', '8.86', '8.67')
('19118038', 'PRINCE KUMAR', '7.93', '8.97', '8.45')
('19118039', 'RAJESH KUMAR', '6.86', '8.38', '7.62')
('19118040', 'SHIVAM KUMAR', '6.83', '8.14', '7.48')
('19118041', 'SHIVAM KUMAR', '7.55', '8.28', '7.91')
('19118042', 'SHIVRAM SINGH', '8.66', '9.31', '8.98')
('19118043', 'SHUBHAM KASHYAP', '8', '9.03', '8.52')
('19118044', 'SHUBHAM KUMAR', '8.07', '8.55', '8.31')
('19118045', 'SONIA', '6.97', '8.83', '7.9')
('19118046', 'TANYA RAJ', '8.62', '9.48', '9.05')
('19118047', 'UJJWAL KUMAR', '7.55', '8.41', '7.9')
('19118048', 'VIKAS', '7.69', '7.97', '7.83')
('19118049', 'VINKUL KUMAR', '7.69', '8.86', '8.28')
('19118050', 'VISHAL SINGH', '7.03', '8.9', '7.97')
('19118052', 'ANKIT KUMAR', '8.03', '8.14', '8.09')
('19118053', 'DAYANAND', '6.38', '8', '7.19')
('19118054', 'DEEPAK KUMAR', '6.69', '8.31', '7.5')
('19118055', 'GOVIND SINGH', '7.17', '6.24', '6.71')
('19118056', 'VISHAL SINGH', '6.79', '7.76', '7.28')
('19118057', 'BOBY KUMAR', '7.76', '8.76', '8.26')

In [11]:
import csv

In [13]:
f=open(r"C:\Users\asus\Documents\MSOFFICE\Excel\IFTM RUSELT.csv","r")
next(f)
data_csv=csv.reader(f,delimiter="\n")
for i in data_csv:
    print(i)

['19118001,AAKASH KUMAR,7.07,7.72,7.4,PASS,,,,,,,,,,,']
['19118002,ABDHESH,6.83,7.41,7.12,PASS,,,,,,,,,,,']
['19118003,ABHISHEK BHARTI,8.07,9.14,8.6,PASS,9.14,,,,,,,,,,']
['19118004,AJAY VANSH,7.31,8.41,7.86,PASS,,,,,,,,,,,']
['19118005,AKASH KUMAR,7.55,8.55,8.05,PASS,,,,,,,,,,,']
['19118006,AMBIKA SONI,7.52,8.86,8.19,PASS,,19118013,8.38,8.83,8.6,,,,,,']
['19118007,AMISH MITTAL,6.03,7.45,6.74,PCP,,,,,,,,,,,']
['19118008,AMIT KUMAR,7.1,7.72,7.41,PASS,,,,,,,19118003,ABHISHEK BHARTI,8.07,9.14,8.6']
['19118052,ANKIT KUMAR,8.03,8.14,8.09,PASS,,,,,,,19118006,AMBIKA SONI,7.52,8.86,8.19']
['19118009,ANKUR KUMAR,8.79,9.14,8.97,PASS,9.14,,,,,,19118009,ANKUR KUMAR,8.79,9.14,8.97']
['19118010,ANSHIKA GOSWAMI,8.66,9.31,8.98,PASS,9.31,,,,,,19118010,ANSHIKA GOSWAMI,8.66,9.31,8.98']
['19118011,ANUJ KUMAR,7.41,8.62,8.02,PASS,,,,,,,19118013,ARSHAD MALIK,8.38,8.83,8.6']
['19118012,ARJUN KUMAR,7.9,8.59,8.24,PASS,,,,,,,19118015,ASHUTOSH KUMAR TIWARI,7.79,9.07,8.43']
['19118013,ARSHAD MALIK,8.38,8.83,8.6,PASS,,Grand Total,22.52,24.65,23.58,,19118018,CHIRAG SINGH,7.69,9,8.34']
['19118014,ARVIND KUMAR,7.1,8.28,7.69,PASS,,,,,,,19118019,DEVENDRA SINGH,9.21,8.86,9.03']
['19118015,ASHUTOSH KUMAR TIWARI,7.79,9.07,8.43,PASS,9.07,,,,,,19118021,DIVYANSH GUPTA,6.97,9.14,8.05']
['19118016,AYUSHI,6.55,6.34,6.45,PASS,,,,,,,19118028,KM. ANCHAL PAWAN,7.24,8.97,8.1']
['19118017,BARJ PAL SINGH,6.9,0.31,3.6,FAIL,,,,,,,19118032,MOHD NADEEM ALI,8.1,9,8.55']
['19118057,BOBY KUMAR,7.76,8.76,8.26,PASS,,,,,,,ROLL NO,NAME,1st SEMESTER SGPA,2nd SEMESTER SGPA,CUMULATIVE GRADE POIMT AVERAGE (CGPA)']
['19118018,CHIRAG SINGH,7.69,9,8.34,PASS,,,,,,,19118037,PRASHASTI,8.48,8.86,8.67']
['19118053,DAYANAND,6.38,8,7.19,PASS,,,,,,,19118038,PRINCE KUMAR,7.93,8.97,8.45']
['19118054,DEEPAK KUMAR,6.69,8.31,7.5,PASS,,,,,,,19118042,SHIVRAM SINGH,8.66,9.31,8.98']
['19118019,DEVENDRA SINGH,9.21,8.86,9.03,PASS,,Row Labels,Sum of 1st SEMESTER SGPA,Sum of 2nd SEMESTER SGPA,Sum of CUMULATIVE GRADE POIMT AVERAGE (CGPA),,19118043,SHUBHAM KASHYAP,8,9.03,8.52']
['19118021,DIVYANSH GUPTA,6.97,9.14,8.05,PASS,9.14,,,,,,19118045,SONIA,6.97,8.83,7.9']
['19118022,DURVESH KUMAR,7.9,8.03,7.97,PASS,,,,,,,19118046,TANYA RAJ,8.62,9.48,9.05']
['19118055,GOVIND SINGH,7.17,6.24,6.71,PASS,,,,,,,19118049,VINKUL KUMAR,7.69,8.86,8.28']
['19118023,HARSH KUMAR GAUTAM,6.69,8.72,7.71,PASS,,,,,,,19118050,VISHAL SINGH,7.03,8.9,7.97']
['19118024,JAGMOHAN SINGH,6.38,0.31,3.34,FAIL,,,,,,,,,,,']
['19118025,JAYDEEP BABU,7.41,8.55,7.98,PASS,,,,,,,,,,,']
['19118026,KAMINI SINGH,6.93,8.55,7.74,PASS,,,,,,,,,,,']
['19118028,KM. ANCHAL PAWAN,7.24,8.97,8.1,PASS,,NAME,(Multiple Items),,,,,,,,']
['19118027,KM. KHUSHBOO,7.69,8.72,8.21,PASS,,,,,,,,,,,']
['19118029,LOKANDER,7.48,8.69,8.09,PASS,,,,,,,,,,,']
['19118030,MAYANK KUMAR,7.07,8.31,7.69,PCP,,,,,,,,,,,']
['19118031,MOHD DANISH,8.93,8.69,8.81,PASS,,,,,,,,,,,']
['19118032,MOHD NADEEM ALI,8.1,9,8.55,PASS,,,,,,,,,,,']
['19118033,MOHIT SAGAR,7.38,8.55,7.97,PASS,,,,,,,,,,,']
['19118034,MUJTABA ALI,9.38,8.28,8.83,PASS,,,,,,,,,,,']
['19118035,NILESH KUMAR,7.76,8.45,8.1,PASS,,,,,,,,,,,']
['19118036,PIYUSH SHARMA,6.9,8.31,7.6,PCP,,,,,,,,,,,']
['19118037,PRASHASTI,8.48,8.86,8.67,PASS,,19118002,6.83,7.41,7.12,,,,,,']
['19118038,PRINCE KUMAR,7.93,8.97,8.45,PASS,,,,,,,,,,,']
['19118039,RAJESH KUMAR,6.86,8.38,7.62,PASS,,,,,,,,,,,']
['19118041,SHIVAM KUMAR,7.55,8.28,7.91,PASS,,,,,,,,,,,']
['19118040,SHIVAM KUMAR,6.83,8.14,7.48,PASS,,,,,,,,,,,']
['19118042,SHIVRAM SINGH,8.66,9.31,8.98,PASS,9.31,,,,,,,,,,']
['19118043,SHUBHAM KASHYAP,8,9.03,8.52,PASS,9.03,,,,,,,,,,']
['19118044,SHUBHAM KUMAR,8.07,8.55,8.31,PASS,,,,,,,,,,,']
['19118045,SONIA,6.97,8.83,7.9,PASS,,,,,,,,,,,']
['19118046,TANYA RAJ,8.62,9.48,9.05,PASS,9.48,,,,,,,,,,']
['19118047,UJJWAL KUMAR,7.55,8.41,7.98,PASS,,,,,,,,,,,']
['19118048,VIKAS,7.69,7.97,7.83,PASS,,,,,,,,,,,']
['19118049,VINKUL KUMAR,7.69,8.86,8.28,PASS,,19118004,7.31,8.41,7.86,,,,,,']
['19118050,VISHAL SINGH,7.03,8.9,7.97,PASS,,,,,,,,,,,']
['19118056,VISHAL SINGH,6.79,7.76,7.28,PASS,,,,,,,,,,,']

In [22]:
f.seek(0)

0

In [24]:
for i in open(r"C:\Users\asus\Documents\MSOFFICE\Excel\IFTM RUSELT.csv","r"):
    print(i)

Roll Number,Name,1Semester,2 Semester,1&2(1 year),,,,,,,,,,,,

19118001,AAKASH KUMAR,7.07,7.72,7.4,PASS,,,,,,,,,,,

19118002,ABDHESH,6.83,7.41,7.12,PASS,,,,,,,,,,,

19118003,ABHISHEK BHARTI,8.07,9.14,8.6,PASS,9.14,,,,,,,,,,

19118004,AJAY VANSH,7.31,8.41,7.86,PASS,,,,,,,,,,,

19118005,AKASH KUMAR,7.55,8.55,8.05,PASS,,,,,,,,,,,

19118006,AMBIKA SONI,7.52,8.86,8.19,PASS,,19118013,8.38,8.83,8.6,,,,,,

19118007,AMISH MITTAL,6.03,7.45,6.74,PCP,,,,,,,,,,,

19118008,AMIT KUMAR,7.1,7.72,7.41,PASS,,,,,,,19118003,ABHISHEK BHARTI,8.07,9.14,8.6

19118052,ANKIT KUMAR,8.03,8.14,8.09,PASS,,,,,,,19118006,AMBIKA SONI,7.52,8.86,8.19

19118009,ANKUR KUMAR,8.79,9.14,8.97,PASS,9.14,,,,,,19118009,ANKUR KUMAR,8.79,9.14,8.97

19118010,ANSHIKA GOSWAMI,8.66,9.31,8.98,PASS,9.31,,,,,,19118010,ANSHIKA GOSWAMI,8.66,9.31,8.98

19118011,ANUJ KUMAR,7.41,8.62,8.02,PASS,,,,,,,19118013,ARSHAD MALIK,8.38,8.83,8.6

19118012,ARJUN KUMAR,7.9,8.59,8.24,PASS,,,,,,,19118015,ASHUTOSH KUMAR TIWARI,7.79,9.07,8.43

19118013,ARSHAD MALIK,8.38,8.83,8.6,PASS,,Grand Total,22.52,24.65,23.58,,19118018,CHIRAG SINGH,7.69,9,8.34

19118014,ARVIND KUMAR,7.1,8.28,7.69,PASS,,,,,,,19118019,DEVENDRA SINGH,9.21,8.86,9.03

19118015,ASHUTOSH KUMAR TIWARI,7.79,9.07,8.43,PASS,9.07,,,,,,19118021,DIVYANSH GUPTA,6.97,9.14,8.05

19118016,AYUSHI,6.55,6.34,6.45,PASS,,,,,,,19118028,KM. ANCHAL PAWAN,7.24,8.97,8.1

19118017,BARJ PAL SINGH,6.9,0.31,3.6,FAIL,,,,,,,19118032,MOHD NADEEM ALI,8.1,9,8.55

19118057,BOBY KUMAR,7.76,8.76,8.26,PASS,,,,,,,ROLL NO,NAME,1st SEMESTER SGPA,2nd SEMESTER SGPA,CUMULATIVE GRADE POIMT AVERAGE (CGPA)

19118018,CHIRAG SINGH,7.69,9,8.34,PASS,,,,,,,19118037,PRASHASTI,8.48,8.86,8.67

19118053,DAYANAND,6.38,8,7.19,PASS,,,,,,,19118038,PRINCE KUMAR,7.93,8.97,8.45

19118054,DEEPAK KUMAR,6.69,8.31,7.5,PASS,,,,,,,19118042,SHIVRAM SINGH,8.66,9.31,8.98

19118019,DEVENDRA SINGH,9.21,8.86,9.03,PASS,,Row Labels,Sum of 1st SEMESTER SGPA,Sum of 2nd SEMESTER SGPA,Sum of CUMULATIVE GRADE POIMT AVERAGE (CGPA),,19118043,SHUBHAM KASHYAP,8,9.03,8.52

19118021,DIVYANSH GUPTA,6.97,9.14,8.05,PASS,9.14,,,,,,19118045,SONIA,6.97,8.83,7.9

19118022,DURVESH KUMAR,7.9,8.03,7.97,PASS,,,,,,,19118046,TANYA RAJ,8.62,9.48,9.05

19118055,GOVIND SINGH,7.17,6.24,6.71,PASS,,,,,,,19118049,VINKUL KUMAR,7.69,8.86,8.28

19118023,HARSH KUMAR GAUTAM,6.69,8.72,7.71,PASS,,,,,,,19118050,VISHAL SINGH,7.03,8.9,7.97

19118024,JAGMOHAN SINGH,6.38,0.31,3.34,FAIL,,,,,,,,,,,

19118025,JAYDEEP BABU,7.41,8.55,7.98,PASS,,,,,,,,,,,

19118026,KAMINI SINGH,6.93,8.55,7.74,PASS,,,,,,,,,,,

19118028,KM. ANCHAL PAWAN,7.24,8.97,8.1,PASS,,NAME,(Multiple Items),,,,,,,,

19118027,KM. KHUSHBOO,7.69,8.72,8.21,PASS,,,,,,,,,,,

19118029,LOKANDER,7.48,8.69,8.09,PASS,,,,,,,,,,,

19118030,MAYANK KUMAR,7.07,8.31,7.69,PCP,,,,,,,,,,,

19118031,MOHD DANISH,8.93,8.69,8.81,PASS,,,,,,,,,,,

19118032,MOHD NADEEM ALI,8.1,9,8.55,PASS,,,,,,,,,,,

19118033,MOHIT SAGAR,7.38,8.55,7.97,PASS,,,,,,,,,,,

19118034,MUJTABA ALI,9.38,8.28,8.83,PASS,,,,,,,,,,,

19118035,NILESH KUMAR,7.76,8.45,8.1,PASS,,,,,,,,,,,

19118036,PIYUSH SHARMA,6.9,8.31,7.6,PCP,,,,,,,,,,,

19118037,PRASHASTI,8.48,8.86,8.67,PASS,,19118002,6.83,7.41,7.12,,,,,,

19118038,PRINCE KUMAR,7.93,8.97,8.45,PASS,,,,,,,,,,,

19118039,RAJESH KUMAR,6.86,8.38,7.62,PASS,,,,,,,,,,,

19118041,SHIVAM KUMAR,7.55,8.28,7.91,PASS,,,,,,,,,,,

19118040,SHIVAM KUMAR,6.83,8.14,7.48,PASS,,,,,,,,,,,

19118042,SHIVRAM SINGH,8.66,9.31,8.98,PASS,9.31,,,,,,,,,,

19118043,SHUBHAM KASHYAP,8,9.03,8.52,PASS,9.03,,,,,,,,,,

19118044,SHUBHAM KUMAR,8.07,8.55,8.31,PASS,,,,,,,,,,,

19118045,SONIA,6.97,8.83,7.9,PASS,,,,,,,,,,,

19118046,TANYA RAJ,8.62,9.48,9.05,PASS,9.48,,,,,,,,,,

19118047,UJJWAL KUMAR,7.55,8.41,7.98,PASS,,,,,,,,,,,

19118048,VIKAS,7.69,7.97,7.83,PASS,,,,,,,,,,,

19118049,VINKUL KUMAR,7.69,8.86,8.28,PASS,,19118004,7.31,8.41,7.86,,,,,,

19118050,VISHAL SINGH,7.03,8.9,7.97,PASS,,,,,,,,,,,

19118056,VISHAL SINGH,6.79,7.76,7.28,PASS,,,,,,,,,,,

In [35]:
import csv
f=open(r"C:\Users\asus\Documents\MSOFFICE\Excel\student_score.csv","r")
next(f)
csv_data=csv.reader(f,delimiter="\n")

In [36]:
for i in csv_data:
    print(i)

['2.5,21']
['5.1,47']
['3.2,27']
['8.5,75']
['3.5,30']
['1.5,20']
['9.2,88']
['5.5,60']
['8.3,81']
['2.7,25']
['7.7,85']
['5.9,62']
['4.5,41']
['3.3,42']
['1.1,17']
['8.9,95']
['2.5,30']
['1.9,24']
['6.1,67']
['7.4,69']
['2.7,30']
['4.8,54']
['3.8,35']
['6.9,76']
['7.8,86']

In [49]:
import mysql.connector as connection

In [50]:
try:
    mydb=conncetion.connect(host="localhost",user="root",password="root",database="uttarp")
    print(mydb.is_connected())
    query="create table score (hourse float,percentage float) "
    mycursor=mydb.cursor()
    mycursor.execute(query)
except Exception as e:
    print(e)

True
1050 (42S01): Table 'score' already exists

In [51]:
f.seek(0)

0

In [52]:
for i in data_csv:
    print(i)
    mycursor.execute("insert into score values({data})".format(data=(i)))
    mydb.commit()    
mydb.close()

In [54]:
for i in enumerate(data_csv):
    for j in i[1]:
        mycursor.execute("insert into score (hourse,score) values({data})".format(data=(j)))
mydb.commit()

MySQLInterfaceError: MySQL server has gone away

In [55]:
import mysql.connector as connection

In [5]:
f=open(r"C:\Users\asus\Documents\MSOFFICE\Excel\student_score.csv","r")
next(f)
csv_data=csv.reader(f,delimiter ="\n")
for i in enumerate(data_csv):
    for j in i[1]:
        mycursor.execute("insert into score (hourse,score) values({data})".format(data=(j)))
mydb.commit()

In [6]:
import mysql.connector as connection

In [7]:
mydb=connection.connect(host="localhost",user="root",password="root",database="uttarp")
print(mydb.is_connected())

True

In [8]:
import csv
mycursor=mydb.cursor()
f=open(r"C:\Users\asus\Documents\MSOFFICE\Excel\student_score.csv","r")
next(f)
data_csv=csv.reader(f,delimiter="\n")
for i in enumerate(data_csv):
    for j in i[1]:
        mycursor.execute("insert into score values ({data})".format(data=(j)))
mydb.commit()

In [9]:
import sqlite3

In [10]:
mydb=sqlite3.connect("simple")

In [11]:
mydb.execute("create table sample (hourse float , score float)")

In [13]:
mydb.execute("insert into sample values(3.2,67.45)")
mydb.commit()

In [16]:
import csv
f=open(r"C:\Users\asus\Documents\MSOFFICE\Excel\student_score.csv","r")
next(f)
data_csv=csv.reader(f,delimiter="\n")
for i in enumerate(data_csv):
    for j in i[1]:
        mydb.execute("insert into sample values ({data})".format(data=(j)))
mydb.commit()